{
  "c1cn[nH]nn1": 10,
  "[C-]C": 10,
  "C1CNCOC1": 10,
  "C1C=NCCN1": 10,
  "C1C=CCCC=C1": 10,
  "C1C=CCNC=C1": 10,
  "C1NC=CCCN1": 10,
  "C1OCCOCO1": 10,
  "c1n[n-]co1": 10,
  "C1=NccCN1": 10,
  "c1cccocc1": 10,
  "c1cocncn1": 10,
  "C1CncN1": 10,
  "c1[nH]nn[nH]1": 11,
  "c1onno1": 11,
  "c1n[nH]co1": 11,
  "c1nn[n-]n1": 11,
  "c1nc[nH]c[nH]1": 11,
  "c1cccccc1": 11,
  "C1C=CCC=CC1": 11,
  "C1CCOC=NC1": 11,
  "C1CC=CCNC1": 11,
  "C1=CCCOCC=C1": 11,
  "C1=NCCCOCO1": 11,
  "c1c[nH]cncn1": 11,
  "C1ncCO1": 11,
  "C1CC[NH+]C1": 11,
  "c1ccn[nH]cc1": 11,
  "c1cc[nH]nnc1": 11,
  "c1ncoco1": 12,
  "C1CN=COCO1": 12,
  "C1CC=CCOC1": 12,
  "C1CNCCNC1": 12,
  "C1NCCCCN1": 12,
  "c1cocon1": 12,
  "C1CncO1": 12,
  "c1ccnocc1": 12,
  "c1cconnc1": 12,
  "c1c[nH]cc[nH]1": 13,
  "C1CN=CCO1": 13,
  "C1CCCC=C1": 13,
  "C1C=NCCO1": 13,
  "C1C=CC=CCO1": 13,
  "C1CCC=CCC1": 13,
  "C1CCC=CCN1": 13,
  "C1CC=CCCN1": 13,
  "C1COCC=CN1": 13,
  "C1C=CNCCN1": 13,
  "c1cOCCO1": 13,
  "C1C=CC=CCC1": 14,
  "C1NC=NCCO1": 14,
  "C1CCCN=CO1": 14,
  "C1C=CCCNC1": 14,
  "C1C=CCCOC1": 14,
  "C1CCOCCOC1": 14,
  "C1=CCccC1": 14,
  "c1cCCCC1": 14,
  "c1cNCCN1": 14,
  "c1cncc[nH]c1": 14,
  "c1cnccoc1": 14,
  "C1ccCC1": 14,
  "C1CCNCCO1": 14,
  "C1C=NCCC1": 15,
  "C1C=CCOCC1": 15,
  "C1=CC[NH2+]C1": 15,
  "C1=CCCCC=CC1": 15,
  "C1=CCCCCC=C1": 15,
  "c1c[nH]nc[nH]1": 15,
  "C1C=Ccc1": 15,
  "c1cc[nH]cnc1": 15,
  "C1=CCNCCC1": 15,
  "C1=CCC=CC1": 16,
  "c1c[nH]c[nH]n1": 16,
  "C1CCCCNC1": 16,
  "C1C=CNCCO1": 17,
  "C1C=CCOCO1": 17,
  "C1CCOCOCC1": 17,
  "C1=NCCN=CN1": 17,
  "c1c[nH]con1": 17,
  "c1cn[nH]nc1": 18,
  "C1C=CNCCC1": 18,
  "C1CCOCCN1": 18,
  "C1COCCCN1": 18,
  "C1NCCCCO1": 18,
  "c1ccocnc1": 18,
  "C1=NCcc1": 18,
  "C1CCCNCC1": 18,
  "c1cococ1": 19,
  "C1CCCC=CN1": 19,
  "C1=CCCOCCC1": 19,
  "c1[nH]nnn1": 19,
  "c1conc[nH]1": 19,
  "C1CNCC=C1": 20,
  "C1C=CCCCN1": 20,
  "C1OCCCCO1": 20,
  "c1nnn[nH]1": 21,
  "c1ncoc[nH]1": 21,
  "c1cocco1": 21,
  "c1c[c-]oc1": 21,
  "C[c-]": 21,
  "C1CC=CCCO1": 21,
  "C1=CCCCCCC1": 21,
  "C1CccO1": 21,
  "C1CNCCCO1": 22,
  "C1=[NH+]CCN1": 22,
  "c1cccc-1": 22,
  "C1CNCO1": 23,
  "C1=NCccN1": 23,
  "C1=NCccO1": 23,
  "C1=CCNcc1": 23,
  "C1=NccCO1": 23,
  "c1cNCCC1": 23,
  "c1cOCOC1": 23,
  "C1CCC=CCO1": 24,
  "C1CC=CCCC1": 24,
  "C1=CCOCCCC1": 24,
  "C1CCCOCCC1": 24,
  "c1conco1": 24,
  "c1nc[n-]n1": 24,
  "C1=CCCcc1": 24,
  "C1=CCOcc1": 24,
  "c1cCOCC1": 24,
  "c1cOCCC1": 24,
  "c1cOCCN1": 24,
  "C1ccCN1": 24,
  "c1c[nH]c[nH]c1": 25,
  "C1=NCCCCCO1": 25,
  "C1COCCCO1": 26,
  "c1cncc-1": 26,
  "c1cnonn1": 27,
  "C1CCOCN1": 27,
  "C1C=CCCCO1": 27,
  "C1CCCCOC1": 27,
  "C1=NCCNC1": 27,
  "c1ncnc-1": 27,
  "C1CccN1": 27,
  "c1cocc[nH]1": 28,
  "C1CCOCCO1": 28,
  "C1ccCO1": 28,
  "C1COCCC1": 29,
  "c1c[n-]nn1": 29,
  "C1CCNCN1": 30,
  "C1CN=CNC1": 30,
  "C1C=CCCCC1": 31,
  "C1=CCOCOC1": 32,
  "C[N-]": 32,
  "C1CCCOCO1": 32,
  "C1CCCCCN1": 32,
  "C1CNCCC1": 33,
  "C1C[NH2+]1": 34,
  "C1=CNCCC1": 34,
  "c1cncncn1": 36,
  "c[NH+]": 37,
  "C1CC=NC1": 39,
  "C1NC=CCO1": 40,
  "C1CC[NH2+]C1": 41,
  "C1=NCCOC1": 41,
  "C1=CCOCC=C1": 42,
  "c1cnonc1": 42,
  "c1nc[nH]nn1": 44,
  "c1nnno1": 46,
  "C1CN=COC1": 46,
  "c1n[nH]c[nH]1": 47,
  "C1CCN=CO1": 47,
  "n1nnnn1": 48,
  "C1=CC=CCC=C1": 49,
  "c1c[nH]coc1": 49,
  "c1cnnnn1": 50,
  "C1NC=CCN1": 50,
  "C1=CCOC=NC1": 50,
  "C1=NCCOCO1": 51,
  "c1ccnc-1": 52,
  "C1CNC=C1": 53,
  "C1CCC=C1": 53,
  "C1=NCCCC1": 53,
  "c1cnccnc1": 56,
  "c1cccncc1": 56,
  "c1cnc[nH]1": 57,
  "C1C[NH+]C1": 57,
  "C1CN=CO1": 58,
  "c=[NH2+]": 59,
  "c1ccncnc1": 59,
  "C1CCN=CN1": 60,
  "C1CCCCCO1": 60,
  "C1C=NCC1": 61,
  "c1nconn1": 61,
  "N[O-]": 63,
  "C1CNCCOC1": 63,
  "C1=CCnc1": 64,
  "c1cnnnc1": 65,
  "c1noc[nH]1": 65,
  "c1nCCO1": 66,
  "C1C=CCOC1": 67,
  "c1nCCN1": 67,
  "C1C=CNC1": 68,
  "C1=CncC1": 68,
  "C1=NCCCN1": 69,
  "C1CC=CCN1": 70,
  "c1c[nH]c[nH]1": 71,
  "C1COCN1": 73,
  "c1nn[nH]n1": 74,
  "c1nnc[nH]1": 75,
  "c1ncnnn1": 76,
  "C1C=CCNC1": 76,
  "c1cOCO1": 76,
  "c1c[nH]ncn1": 78,
  "c1cCNC1": 78,
  "C1NCCCN1": 80,
  "c1n[nH]cn1": 80,
  "C1=CCCOCC1": 84,
  "C1C=CNCC1": 86,
  "C1CNCN1": 88,
  "c1cn[nH]cn1": 88,
  "c1concn1": 89,
  "c1nc[nH]cn1": 92,
  "C1COCC1": 92,
  "C1=CCCC=CC1": 94,
  "C1CCC=CN1": 95,
  "c1noco1": 96,
  "c1nnco1": 99,
  "c1cCOC1": 103,
  "C1C=CCCN1": 105,
  "C1OCCCO1": 108,
  "c1nocn1": 110,
  "c1nCCC1": 110,
  "C=[NH+]": 111,
  "C1NCCCO1": 112,
  "c1cnn[nH]c1": 112,
  "c1c[nH]ccn1": 113,
  "c1ccnnc1": 116,
  "C[C-]": 116,
  "C1CNCC1": 120,
  "C1CC=CCO1": 123,
  "C1=CCCCC=C1": 127,
  "C1CCOCOC1": 127,
  "c1nncn1": 131,
  "C1COCCOC1": 132,
  "c1nnon1": 137,
  "C1CCOCO1": 139,
  "c1ncncn1": 140,
  "C1C=CCCO1": 140,
  "[N+][O-]": 142,
  "[N+]=O": 142,
  "c[N+]": 142,
  "c1ncocn1": 144,
  "c1cnocn1": 148,
  "c1cnnoc1": 149,
  "C1CCCCCC1": 151,
  "C1OCCO1": 160,
  "c1coco1": 170,
  "c1coccn1": 176,
  "C1CC=CCC1": 178,
  "C1=CCcc1": 178,
  "c[O-]": 186,
  "C1C[NH2+]C1": 187,
  "C[NH+]": 190,
  "C1=NCCCCO1": 190,
  "C1=CCOCCC1": 193,
  "C1CNCCO1": 203,
  "C1=CNCC1": 210,
  "C1CNCCN1": 211,
  "C1NCCN1": 216,
  "c1nnnn1": 216,
  "C1CCCOC1": 219,
  "C1CCCNC1": 220,
  "c1cOCC1": 222,
  "C=[NH2+]": 236,
  "C1C=CCCC1": 246,
  "c1cnncn1": 255,
  "c1cc[nH]cc1": 256,
  "c1cc[nH]nc1": 260,
  "C1=CCNCC1": 260,
  "c1coc[nH]1": 267,
  "c1cCCC1": 267,
  "C1=CCCCCC1": 287,
  "C1CC=CN1": 290,
  "c1ccccc1": 291,
  "c1cconc1": 296,
  "c1cNCC1": 296,
  "C1CCCCN1": 299,
  "c1cnon1": 301,
  "C1CN=CN1": 309,
  "c1cn[nH]n1": 315,
  "c1cnc[nH]c1": 320,
  "c1cnccn1": 327,
  "C1CCCOCC1": 332,
  "C1C=CCN1": 333,
  "c1nc[nH]n1": 337,
  "C1C=CCO1": 340,
  "C1NCCO1": 378,
  "C[NH2+]": 401,
  "c1ccocc1": 401,
  "C1CC=CC1": 402,
  "C1COCCO1": 434,
  "C1CCNCC1": 459,
  "c1ncnn1": 475,
  "C1=NCCC1": 479,
  "c1cncoc1": 493,
  "c1ncon1": 506,
  "c1c[nH]nn1": 518,
  "C1CCCCO1": 528,
  "c1nCC1": 573,
  "C1COCOC1": 599,
  "C1COCCN1": 602,
  "c1cncnc1": 607,
  "c1cnnn1": 620,
  "C[NH3+]": 655,
  "c1conn1": 677,
  "c1cnnc1": 719,
  "C1=NCCCO1": 722,
  "c1ccnc1": 737,
  "C1=NCCN1": 798,
  "C1=CCNC1": 803,
  "c1ccncc1": 815,
  "C1=CCOCC1": 851,
  "c1cncn1": 865,
  "C1C=CCC1": 877,
  "C[O-]": 1136,
  "C1CCCN1": 1227,
  "C1=CCOC1": 1285,
  "c1c[nH]cn1": 1348,
  "C1=NCCO1": 1348,
  "CF": 1348,
  "C1COCO1": 1387,
  "c1cnoc1": 1513,
  "c1ccoc1": 1537,
  "c1cn[nH]c1": 1609,
  "c1cocn1": 1674,
  "C1CCCCC1": 1678,
  "c1cc[nH]c1": 1784,
  "C1=CCCCC1": 1825,
  "NO": 1863,
  "C1CCCO1": 1945,
  "cF": 1966,
  "C1CCOCC1": 2291,
  "C1CCN1": 2601,
  "C1CCO1": 2829,
  "Cc": 3155,
  "c=O": 3300,
  "c=N": 3436,
  "Cn": 3494,
  "C1CCNC1": 4757,
  "cO": 6370,
  "C1=CCCC1": 7388,
  "cN": 8102,
  "C1CCOC1": 9425,
  "C1CO1": 10664,
  "C1CCCC1": 11547,
  "C=N": 12123,
  "cC": 12503,
  "C1COC1": 15844,
  "C#N": 17500,
  "C1CNC1": 17510,
  "C#C": 19492,
  "C1CN1": 19753,
  "C1CC1": 32461,
  "CN": 33322,
  "C1CCC1": 38863,
  "C=O": 52740,
  "CO": 75286,
  "CC": 205148
}